app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "newtitle "], ["description", "hello this a new article"], ["created_at", "2018-01-22 03:43:26.612031"], ["updated_at", "2018-01-22 03:43:26.612031"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "thejbdlfkb edited"], ["description", "a;SKJB;rkbjeR edited"], ["updated_at", "2018-01-22 04:52:59.054825"], ["id", 9]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)